Repository: alejandroautalan/pygubu-designer
Catalog: pygubudesigner/locale/*/LC_MESSAGES/pygubu.po
Languages: es, tr

source: Pygubu Preferences
es: Preferencias
tr: Pygubu Ayarları

source: Preferred widget set:
es: Conjunto de widgets preferido:

source: Preferred ttk theme:
es: Tema ttk preferido:

source: Widget naming:
es: Nombre de widgets:

source: No separator (e.g. button1)
es: Sin separador (ej. button1)

source: Use "_" as separator (e.g. button_1)
es: Usar "_" como separador (ej. button_1)

source: Uppercase first letter (e.g. Button…)
es: Primera letra en mayúscula (ej. Button1)

source: This does not affect previously generated names.
es: Esto no afecta los nombres generados previamente.

source: Hidden options:
es: Opciones ocultas:

source: Window geometry:
es: Geometría de la ventana:

source: Custom Widgets
es: Widgets Personalizados
tr: Özel Araçlar

source: Custom Widgets Builders
es: Constructores Personalizados
tr: Özel Araç Oluşturucuları

source: Requires restart.
es: Es necesario reiniciar el programa para cargar los nuevos widgets.
tr: Yeniden başlatma gerektirir.

source: modules
es: módulos
tr: modüller

source: Close
es: Cerrar
tr: Kapat

source: File
es: Archivo
tr: Dosya

source: New
es: Nuevo
tr: Yeni

source: Open …
es: Abrir …
tr: Aç …

source: Open recent …
es: Abrir reciente …
tr: Son dosyayı aç …

source: Clear list
es: Limpiar lista
tr: Listeyi temizle

source: Save
es: Guardar
tr: Kaydet

source: Save as …
es: Guardar como …
tr: Farklı kaydet …

source: Quit …
es: Salir …
tr: Çık …

source: Edit
es: Editar
tr: Düzenle

source: Copy
es: Copiar
tr: Kopyala

source: Paste
es: Pegar
tr: Yapıştır

source: Cut
es: Cortar
tr: Kes

source: Widget tree
es: Arbol de widgets
tr: Araç ağacı

source: Item up
es: Item arriba
tr: Öğeyi yukarı taşı

source: Item down
es: Item abajo
tr: Öğeyi aşağı taşı

source: Item delete
es: Borrar item
tr: Öğeyi sil

source: Widget grid
es: Grilla
tr: Araç ızgarası

source: Move up
es: Mover arriba
tr: Yukarı taşı

source: Move down
es: Mover abajo
tr: Aşağı taşı

source: Move left
es: Mover izquierda
tr: Sola taşı

source: Move right
es: Mover derecha
tr: Sağa taşı

source: Preferences
es: Preferencias
tr: Tercihler

source: Preview
es: Previsualización
tr: Ön İzleme

source: Preview in Toplevel
es: Previsualizar en ventana
tr: Toplevel'de Ön İzleme

source: Close Toplevel previews
es: Cerrar previsualizaciones
tr: Toplevel Ön İzlemelerini kapat

source: ttk theme
es: Tema ttk
tr: ttk teması

source: Help
es: Ayuda
tr: Yardım

source: Help (Online)
es: Ayuda (en línea)
tr: Yardım (Çevrim içi)

source: About …
es: Acerca de …
tr: Hakkında …

source: Object Tree
es: Árbol de objetos
tr: Nesne Ağacı

source: Filter:
es: Filtrar:
tr: Filtre:

source: Widget Id
es: ID de widget
tr: Araç Adı

source: Class
es: Clase

source: R
es: F
tr: Str

source: Design
es: Diseño
tr: Tasarım

source: Object Properties
es: Propiedades del objeto
tr: Nesne Özellikleri

source: Layout
es: Disposición
tr: Yerleşim

source: Sequence descriptor
es: Descriptor de secuencia

source: Event Handler
es: Controlador de evento
tr: Olay İşleyici (Event Handler)

source: Add
es: Agregar
tr: Ekle

source: Code
es: Código
tr: Kod

source: Template description here.
es: Descripción de la plantilla AQUI.
tr: Taslak açıklaması.

source: Template:
es: Plantilla:
tr: Taslak:

source: Application
es: Aplicación
tr: Uygulama

source: Code Script
es: Script de codigo
tr: Kod metni

source: Custom Widget
es: Widget Personalizado
tr: Özel Araç

source: Options:
es: Opciones:
tr: Seçenekler:

source: Main widget:
es: Widget principal:
tr: Ana araç:

source: Class Name:
es: Nombre de la clase:
tr: Class Adı:

source: Generate
es: Generar
tr: Oluştur

source: Copy to Clipboard
es: Copiar al portapapeles
tr: Panoya Kopyala

source: Messages
es: Mensajes
tr: Mesajlar

source: Save Changes
es: Guardar Cambios

source: SaveIcon
es: IconoGuardar

source: Message
es: Mensaje

source: Detail
es: Detalle

source: Don't Save
es: No guardar

source: Cancel
es: Cancelar

source: About
es: Acerca de …
tr: Hakkında

source: v%version%
es: versión %version%

source: pygubu-designer v%version%
es: pygubu-designer versión %version%

source: pygubu is a graphical user interface designer for tkinter
es: pygubu es un diseñador de interfaces gráficas para el módulo tkinter
tr: pygubu, tkinter için bir kullanıcı arayüzü tasarlayıcısıdır

source: This program comes with ABSOLUTELY NO WARRANTY for details, visit http://www.gnu.org/licenses/gpl-3.0.html
es: Este programa se distribuye SIN NINGUNA GARANTÍA; para más detalles visite http://www.gnu.org/licenses/gpl-3.0.html
tr: Bu program kesinlikle garanti sağlamaz detaylar için ziyaret ediniz: http://www.gnu.org/licenses/gpl-3.0.html

source: Python module
es: Módulo python
tr: Python modülü

source: All
es: Todos
tr: Hepsi

source: Grid row '{0}' options:
es: Opciones para fila '{0}':
tr: Izgara (Grid) satırı '{0}' seçenekleri:

source: Grid column '{0}' options:
es: Opciones para columna '{0}':
tr: Izgara (Grid) sütunu '{0}' seçenekleri:

source: Change Manager
es: Cambiar Manager
tr: Yöneticiyi Değiştir

source: Change manager from {0} to {1}?
es: ¿Cambiar manager de {0} a {1}?
tr: Yönetici {0}'dan {1}'e değiştirilsin mi?

source: All container widgets will be updated.
es: Todos los widgets del contenedor serán actualizados.
tr: Tüm kapsayıcı (container) araçlar güncellenecek.

source: Widget properties
es: Propiedades del widget
tr: Araç özellikleri

source: Required
es: Requerida
tr: Gerekli

source: Standard
es: Estándar
tr: Standart

source: Specific
es: Específica
tr: Özgü

source: Custom
es: Personalizada
tr: Özel

source: Send widget ID
es: Enviar widget ID

source: Type of action.
es: Tipo de acción.

source: Index of character string to be inserted/deleted.
es: Índice de la cadena de caracteres que se insertará/eliminará.

source: The new/current value of the entry.
es: El valor nuevo/actual del entry.

source: The current value of entry prior to editing.
es: El valor actual del entry antes de la edición.

source: The text string being inserted/deleted.
es: La cadena de texto que se inserta/elimina.

source: The current value of the -validate option.
es: El valor actual de la opción "-validate".

source: The validation condition that triggered the callback.
es: La condición de validación que originó la llamada.

source: The name of the entry widget.
es: El nombre del widget entry.

source: Select all
es: Seleccionar todo

source: Clear
es: Limpiar lista

source: Tk image formats
es: Formatos de imagen Tk
tr: Tk görüntü formatları

source: All Files
es: Todos los archivos
tr: Tüm Dosyalar

source: Delete items
es: Borrar items
tr: Öğeleri sil

source: Delete selected items?
es: ¿ Borrar items seleccionados ?
tr: Seçilen öğeler silinsin mi?

source: No item selected.
es: No selecciono item.
tr: Hiç öğe seçilmedi.

source: Allowed children: %s.
es: Hijos permitidos: %s.
tr: İzin verilen çocuk (child): %s.

source: Only {0} children allowed for {1}
es: Solo se permiten {0} hijos para {1}
tr: {1} için sadece {0} çocuk (children) için izin verilir.

source: {0} not allowed as parent of {1}
es: {0} no es permitido como padre de {1}
tr: {1}'in içereni (parent) olarak {0}'a izin verilmiyor.

source: Not allowed, %s is not a container.
es: No permitido, %s no es un contenedor.
tr: %s bir içeren (container) değil, izin verilmez.

source: %s not allowed at root level
es: %s no esta permitido a nivel raiz
tr: %s'e kök seviyesinde izin verilmez

source: Not allowed at root level, %s is not a container.
es: No permitido a nivel raiz, %s no es un contenedor.
tr: %s bir içeren (container) değil, kök seviyesinde izin verilmez.

source: Failed to load widget module: '%s'
es: Error al cargar modulo de widget: '%s'
tr: Araç modülü '%s' yüklenirken hata oluştu.

source: Failed to load custom widget module: '%s'
es: Error al cargar modulo de widget personalizado: '%s'
tr: Özel araç modülü: '%s' yüklenirken hata oluştu.

source: If you don't save the document, all the changes will be lost.
es: Si no guarda el documento, todos los cambios se perderán.

source: Do you want to save the changes before closing?
es: ¿Quieres guardar los cambios antes de cerrar?

source: Project saved to %s
es: Proyecto guardado a %s
tr: Proje %s'e kaydedildi

source: pygubu ui
es: Archivos de pygubu
tr: pygubu arayüzü

source: Do you want to save the changes before opening?
es: ¿Quieres guardar los cambios antes de abrir?

source: Do you want to save the changes before creating?
es: ¿Quieres guardar los cambios antes de crear?

source: newproject
es: nuevo_proyecto
tr: yeniproje

source: Script Generator
es: Generador de Script
tr: Kod Oluşturucu

source: Create a pygubu application script using the UI definition.
es: Crear una aplicación pygubu usando el archivo UI actual.
tr: Arayüz tanımı için bir pygubu uygulaması kodu oluşturun.

source: Create a coded version of the UI definition.
es: Crear un versión en codigo del archivo UI actual.
tr: Arayüz tanımı için kod oluşturun.

source: Create a base class for your custom widget.
es: Crear un clase base para su widget personalizado.
tr: Özel araç için bir temel (base) class oluşturun.

source: Code copied
es: Se copió al portapapeles
tr: Kod kopyalandı

source: Select widget
es: Seleccione widget
tr: Araç seçin

source: Select template
es: Seleccione plantilla
tr: Şablon seçin

source: Enter classname
es: Ingrese nombre de la clase
tr: Class adı girin

source: General
tr: Genel

source: Prefered widget set:
tr: Seçilen araç takımı:

source: C
tr: Stn

source: Bindings
tr: Bağlayıcılar (Binding)

source: Grid
tr: Izgara

source: Pack
tr: Yerleştir

source: Place
tr: Konumlandır

source: Error
tr: Hata

source: File changed
tr: Dosya değişti

source: Changes not saved. Quit anyway?
tr: Değişiklikler kaydedilmedi. Yine de çıkılsın mı?

source: Changes not saved. Open new file anyway?
tr: Değişiklikler kaydedilmedi. Yine de yeni dosya açılsın mı?

source: Changes not saved. Discard Changes?
tr: Değişiklikler kaydedilmedi. Değişiklikler silinsin mi?

source: Python Script
tr: Python Kodu
